{"pageProps":{"posts":[{"path":"/projects/MazeGame","title":"MazeGame","subtitle":"A JavaFX Puzzle Game with Dynamic Mazes and BFS Solver","description":"MazeGame is a Java-based puzzle game featuring a goose navigating dynamic mazes with autosolve functionality using BFS. Includes CLI and GUI modes with asset integrity checks.","keywords":"MazeGame, Java game, JavaFX, maze solver, BFS algorithm, Java CLI, game development, Java multithreading, Java GUI, puzzle game, intro to Java project, object-oriented programming","github":"https://github.com/smp46/MazeGame","type":"undergrad","date":"2025-05-13","created":"2024-11-22","updated":"2025-05-13"},{"path":"/projects/PortfolioWebsite","title":"Portfolio Website","subtitle":"Building My Developer Portfolio with Next.js, MDX, and GitHub Actions","description":"A fully statically-generated personal portfolio built with Next.js, React, and TypeScript. It showcases projects, articles written in MDX, and a bit about me.","keywords":"personal website, portfolio, Next.js, React, TypeScript, static site generation, MDX, GitHub Actions, web development, developer portfolio","github":"https://github.com/smp46/smp46.github.io","type":"personal","date":"2025-05-13","created":"2025-04-08","updated":"2025-05-13"},{"path":"/projects/RightClickVirusTotal","title":"RightClickVirusTotal","subtitle":"Cross-Platform File Scanning with VirusTotal API","description":"RightClickVirusTotal is a Python-based tool that adds file virus scanning directly to your context menu via the VirusTotal API. Now available with CLI and GUI for Windows, Linux, and macOS.","keywords":"RightClickVirusTotal, VirusTotal API, Python virus scanner, file analysis, security tool, Tkinter GUI, CLI scanner, cross-platform malware detection, right-click integration, PyInstaller, Windows context menu tool","github":"https://github.com/smp46/RightClickVirusTotal","type":"personal","date":"2025-05-13","created":"2024-11-22","updated":"2025-05-13"},{"path":"/projects/SmartGarage","title":"SmartGarage","subtitle":" A DIY Wireless Garage Door Control System with a Side of Machine Learning","description":"SmartGarage is a custom-built IoT solution that enables remote garage door control without modifying the original opener. Using a Raspberry Pi, relay circuit, and machine learning image recognition, it provides door status monitoring, remote operation, and automated notifications—all built with off-the-shelf components.","keywords":"SmartGarage, Raspberry Pi garage door, machine learning IoT, MobileNetV3 image recognition, DIY smart home, remote garage control, Python image classification, Rust API server, garage door automation, security camera integration, homepage dashboard, wireless garage opener","github":"https://github.com/smp46/SmartGarage","type":"personal","date":"2025-05-14","created":"2025-05-11","updated":"2025-05-14"},{"path":"/projects/StoryPath","title":"StoryPath","subtitle":"A Location-Based Platform for Interactive Tours & Treasure Hunts","description":"StoryPath is a cross-platform experience builder for creating location-based virtual museum exhibits, clue-driven treasure hunts, and interactive tours. Built with React, React Native, and Expo.","keywords":"StoryPath, location-based experiences, virtual exhibits, interactive tours, treasure hunt app, React, React Native, Expo, Tailwind CSS, ChatGPT API, geolocation app, QR code scavenger hunt","github":"https://github.com/smp46/StoryPath","type":"undergrad","date":"2025-05-13","created":"2025-04-15","updated":"2025-05-13"},{"path":"/projects/UQInc","title":"UQInc","subtitle":"A Rust-Powered UQ Campus Clicker Game","description":"UQInc is a fast-paced idle clicker game built in Rust during the UQCS 2024 Hackathon. Construct your dream University of Queensland campus, upgrade buildings, and earn perks—all within a retro-style GUI built with macroquad.","keywords":"UQInc, Rust clicker game, idle game, UQCS hackathon, macroquad game, Rust GUI, game dev Rust, university builder game, incremental game, Rust project","github":"https://github.com/smp46/UQInc","type":"undergrad","date":"2025-05-13","created":"2024-11-22","updated":"2025-05-13"},{"path":"/projects/dockerImageServer","title":"dockerImageServer","subtitle":"Docker Image Server for Periodic Image Fetching with Nginx","description":"dockerImageServer is a lightweight Docker container that periodically downloads an image from a URL and serves it via Nginx. Ideal for use cases like exposing security camera snapshots through a reverse proxy.","keywords":"Docker, Nginx, image server, reverse proxy, security camera, docker container, open source, devops tools, docker compose, docker run, automation","github":"https://github.com/smp46/dockerImageServer","type":"personal","date":"2025-05-13","created":"2024-11-22","updated":"2025-05-13"}]},"__N_SSG":true}